In [2]:
import pandas as pd

customers = pd.DataFrame({'customer_id':[1,2,3,4],'name':["Alice", "Bob","Charlie", 'Diana'],"city": ["NYC", "UA", "Chicago", "India"],
    "salary": [50000, 60000, 70000, 80000]})

In [12]:
pd.melt(customers, id_vars=None, value_vars=None, var_name='variable',value_name='value')
pd.melt(customers,  var_name='variable',value_name='value')
pd.melt(customers)

       variable    value
0   customer_id        1
1   customer_id        2
2   customer_id        3
3   customer_id        4
4          name    Alice
5          name      Bob
6          name  Charlie
7          name    Diana
8          city      NYC
9          city       UA
10         city  Chicago
11         city    India
12       salary    50000
13       salary    60000
14       salary    70000
15       salary    80000

In [18]:
sales_data = {"products":["laptop",'phone','tables'],
              "Q1_2023":[1200,800,450],
            "Q2_2023":[1350,920,520],
            "Q3_2023":[1180,750,480]}
sales_df = pd.DataFrame(sales_data)
print(sales_df)

  products  Q1_2023  Q2_2023  Q3_2023
0   laptop     1200     1350     1180
1    phone      800      920      750
2   tables      450      520      480

In [22]:
pd.melt(sales_df)
melted_data = pd.melt(sales_df, id_vars=["products"],var_name="Quater",value_name="Sales")
melted_data['Quater'].str.replace('_2023','')
print(melted_data.head())

  products   Quater  Sales
0   laptop  Q1_2023   1200
1    phone  Q1_2023    800
2   tables  Q1_2023    450
3   laptop  Q2_2023   1350
4    phone  Q2_2023    920

In [29]:
stacked_sales = sales_df.set_index("products").stack()
# stacked_sales.name = "Sales"
# stacked_sales.index.name = ["product", 'quater']
# stacked_df = stacked_sales.reset_index()